B35doc/English/online/cfysm_C2/samples/ElectricalManageLinks/PlaceAssemblyfromXML.xml

<SOAP_ENV:Envelope xmlns:SOAP_ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ixf="http://www.ixfstd.org/std/ns/core/1.0" xmlns:tns="IXF_Schema.xsd" xsi:schemaLocation="IXF_Schema.xsd ElectricalSchema.xsd" xmlns:NS1="CATIA/V5/Electrical/1.0" xmlns:NS2="http://www.ixfstd.org/std/ns/core/classBehaviors/links/1.0" xmlns:NS3="CATIA/V5/ElecFunctionalBehavior/1.0">
<SOAP_ENV:Body>
<ixf:object xsi:type="tns:Equipment" id="EQT_Z">
  <tns:Name>PAC012_Z</tns:Name>
  <NS1:Product>
    <NS1:PartNumber>PAC012</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object xsi:type="tns:Connector" id="SIC_1">
  <tns:Name>PAC8815_A</tns:Name>
  <NS1:Product>
    <NS1:PartNumber>PAC8815</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object xsi:type="tns:Connector" id="SIC_2">
  <tns:Name>PAC8815_B</tns:Name>
  <NS1:Product>
    <NS1:PartNumber>PAC8815</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object xsi:type="tns:Connector" id="SIC_3">
  <tns:Name>PAC8815_C</tns:Name>
  <NS1:Product>
    <NS1:PartNumber>PAC8815</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object xsi:type="tns:Connector" id="SIC_4">
  <tns:Name>PAC8815_D</tns:Name>
  <NS1:Product>
    <NS1:PartNumber>PAC8815</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object xsi:type="tns:DeviceLink" id="ID_1">
  <NS2:link>
    <NS2:object1 href="#EQT_Z"/>
    <NS2:object2 href="#SIC_1"/>
  </NS2:link>
</ixf:object>
<ixf:object xsi:type="tns:DeviceLink" id="ID_1">
  <NS2:link>
    <NS2:object1 href="#EQT_Z"/>
    <NS2:object2 href="#SIC_2"/>
  </NS2:link>
</ixf:object>
<ixf:object xsi:type="tns:DeviceLink" id="ID_1">
  <NS2:link>
    <NS2:object1 href="#EQT_Z"/>
    <NS2:object2 href="#SIC_3"/>
  </NS2:link>
</ixf:object>
<ixf:object xsi:type="tns:DeviceLink" id="ID_1">
  <NS2:link>
    <NS2:object1 href="#EQT_Z"/>
    <NS2:object2 href="#SIC_4"/>
  </NS2:link>
</ixf:object>
</SOAP_ENV:Body>
</SOAP_ENV:Envelope>
